// подсчитайте при помощи цикла сколько раз в строке повторилась буква а. Покажите число повторений в консоли
// если вы придумали несколько способов решения, можете описать все ))

let str = 'Земля в иллюминаторе видна';
let countA = 0;
for (let i = 0; i < str.length; i++) {}
console.log(countA); //2

//Замените все цифры 0, на букву "о" при помощи цикла. Не изменяйте изначальную переменную,
// просто сохраните изменённую строку в новой переменной

let str2 = 'Г0р0д0к как к0р0б0к';
let str3 = '';
for (let i = 0; i < str2.length; i++) {}

console.log(str3); // 'Городок как коробок'

// В строке "its-my-live-its-my-world" уберите все дефисы, а букву идущую после дефиса сделайте большой
// должно получиться "itsMyLiveItsMyWorld"
let str4 = 'its-my-live-its-my-world';
let str5 = '';

for (let i = 0; i < str4.length; i++) {}

console.log(str5); //"itsMyLiveItsMyWorld"
